/// @DnDAction : YoYo Games.Common.Execute_Code
/// @DnDVersion : 1
/// @DnDHash : 5B6DBFE2
/// @DnDArgument : "code" "// Код для уничтожения камня при нажатии на него$(13_10)instance_destroy(); // Удаляем этот объект$(13_10)$(13_10)// Увеличиваем счётчик столкновений$(13_10)collision_count += 1;$(13_10)$(13_10)$(13_10)// Проверяем, достиг ли счётчик 3$(13_10)if (collision_count >= 3) {$(13_10)    // Если достигли 3 столкновений, уничтожаем камень$(13_10)    instance_destroy();$(13_10)}$(13_10)$(13_10)$(13_10)"
// Код для уничтожения камня при нажатии на него
instance_destroy(); // Удаляем этот объект

// Увеличиваем счётчик столкновений
collision_count += 1;


// Проверяем, достиг ли счётчик 3
if (collision_count >= 3) {
    // Если достигли 3 столкновений, уничтожаем камень
    instance_destroy();
}